def line_pairs_generator():  # Оголошуємо функцію-генератор
    """Генератор, який читає text100.txt і повертає по 3 пари для кожного рядка."""  # Опис функції

    f = open("text100.txt", "r", encoding="utf-8")  # Відкриваємо файл у режимі читання

    line_number = 0  # Лічильник номерів рядків
    for line in f:  # Читаємо файл пострічково
        line_number += 1  # Збільшуємо номер рядка

        words = line.strip().split()  # Забираємо пробіли і ділимо рядок на слова
        pairs = {}  # Тут зберігатимуться всі знайдені пари букв у цьому рядку

        # ---- Рахуємо пари всередині кожного слова ----
        for w in words:  # Перебираємо кожне слово рядка
            w = w.lower()  # Перетворюємо слово в нижній регістр
            clean = ""  # Сюди будемо записувати слово тільки з букв

            # залишаємо лише букви
            for ch in w:  # Перевіряємо кожен символ слова
                if ch.isalpha():  # Якщо символ — буква
                    clean += ch  # Додаємо його до очищеного слова

            # рахуємо пари всередині слова
            for i in range(len(clean) - 1):  # Проходимо по індексах для створення пар
                pair = clean[i] + clean[i + 1]  # Пара з двох сусідніх букв

                if pair not in pairs:  # Якщо такої пари ще немає
                    pairs[pair] = 1  # Створюємо ключ і ставимо кількість 1
                else:
                    pairs[pair] += 1  # Якщо пара вже є — збільшуємо кількість

        # ---- Вибираємо 3 найбільш часті пари ----
        top3 = sorted(pairs.items(), key=lambda x: x[1], reverse=True)[:3]  
        # Сортуємо пари за кількістю (від більшої до меншої) і беремо перші три

        # перетворюємо назад у словник
        top3_dict = {p: c for p, c in top3}  # Створюємо словник із трійки найчастіших пар

        # повертаємо номер рядка та 3 пари
        yield line_number, top3_dict  # Генератор повертає результат, але не завершує функцію

    f.close()  # Закриваємо файл після завершення циклу



# --------------- ОСНОВНА ЧАСТИНА -----------------

for num, top_pairs in line_pairs_generator():  # Отримуємо дані з генератора пострічково
   print("Рядок", num, "---", top_pairs)  # Виводимо номер рядка та 3 найчастіші пари
