import time                    #імпорт модуля time, який дозволяє робити паузи (sleep()"
import functools               #імпорт модуля для збереження метаданих функції, яку декоруємо (wraps)

def delay(seconds):            #Оголошення функції delay, яка приймає параметр seconds — скільки секунд буде штучна затримка/  функція, яка повертає інший декоратор

    def decorator(func):                                #Усередині delay() створюється функція-декоратор/  func — функція, яку будемо декорувати
        @functools.wraps(func)                          #Декоратор wraps копіює назву функції, документацію, атрибути/  Завдяки цьому wrapper не затирає оригінальні дані func
        def wrapper(*args, **kwargs):                    #wrapper — обгортка навколо функції/   Приймає будь-які аргументи (*args, **kwargs)
            print(f"Очікування {seconds} секунд(и)...")  #Перед виконанням функції виводимо повідомлення про затримку
            time.sleep(seconds)                           # штучна затримка
            result = func(*args, **kwargs)                #Викликається оригінальна функція, яка була прикрашена декоратором
            return result
        return wrapper                                    #Декоратор повертає wrapper — тобто модифіковану версію функції
    return decorator                                      #Функція delay() повертає функцію-декоратор
 